
# State **`s3://infrahouse-aws-s3-control/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       4 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                              |
|:--------:|:-------------------------------------------------------------------------------------------------------|
|    🟢     | `module.buckets["infrahouse8-aws-control"].aws_s3_bucket.state-bucket`                                 |
|    🟢     | `module.buckets["infrahouse8-aws-control"].aws_s3_bucket_public_access_block.public_access`            |
|    🟢     | `module.buckets["infrahouse8-aws-control"].aws_s3_bucket_server_side_encryption_configuration.default` |
|    🟢     | `module.buckets["infrahouse8-aws-control"].aws_s3_bucket_versioning.enabled`                           |
|    🟢     | `module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket:`                               |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/bf37f764-697b-4f75-a8dd-9091bcfcb859/terraform-bin plan -var-file=configuration.tfvars --out=tf.plan
module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-website-infra]
module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control]
module.buckets["infrahouse-aws-s3-control"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-s3-control]
module.buckets["infrahouse-website-infra"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-website-infra]
module.buckets["infrahouse-website-infra"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-website-infra]
module.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-s3-control"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-s3-control]
module.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-s3-control"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-s3-control]
module.buckets["infrahouse-aws-control"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control]
module.buckets["infrahouse-aws-control"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control]
module.buckets["infrahouse-website-infra"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-website-infra]
module.buckets["infrahouse-aws-control"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control]
module.buckets["infrahouse-aws-s3-control"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-s3-control]
module.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.buckets["infrahouse8-aws-control"].aws_s3_bucket.state-bucket will be created
  + resource "aws_s3_bucket" "state-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "infrahouse8-aws-control"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "created_by"  = "infrahouse8/aws-s3-control"
          + "description" = "Terraform state for https://github.com/infrahouse8/aws-control"
        }
      + tags_all                    = {
          + "created_by"  = "infrahouse8/aws-s3-control"
          + "description" = "Terraform state for https://github.com/infrahouse8/aws-control"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.buckets["infrahouse8-aws-control"].aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.buckets["infrahouse8-aws-control"].aws_s3_bucket_server_side_encryption_configuration.default will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.buckets["infrahouse8-aws-control"].aws_s3_bucket_versioning.enabled will be created
  + resource "aws_s3_bucket_versioning" "enabled" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-website-infra]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control]%0Amodule.buckets["infrahouse-aws-s3-control"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-s3-control]%0Amodule.buckets["infrahouse-website-infra"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-website-infra]%0Amodule.buckets["infrahouse-website-infra"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-website-infra]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-s3-control"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-s3-control]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-s3-control"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-s3-control]%0Amodule.buckets["infrahouse-aws-control"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control]%0Amodule.buckets["infrahouse-aws-control"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control]%0Amodule.buckets["infrahouse-website-infra"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-website-infra]%0Amodule.buckets["infrahouse-aws-control"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control]%0Amodule.buckets["infrahouse-aws-s3-control"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-s3-control]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.buckets["infrahouse8-aws-control"].aws_s3_bucket.state-bucket will be created%0A  + resource "aws_s3_bucket" "state-bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "infrahouse8-aws-control"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "created_by"  = "infrahouse8/aws-s3-control"%0A          + "description" = "Terraform state for https://github.com/infrahouse8/aws-control"%0A        }%0A      + tags_all                    = {%0A          + "created_by"  = "infrahouse8/aws-s3-control"%0A          + "description" = "Terraform state for https://github.com/infrahouse8/aws-control"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse8-aws-control"].aws_s3_bucket_public_access_block.public_access will be created%0A  + resource "aws_s3_bucket_public_access_block" "public_access" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # module.buckets["infrahouse8-aws-control"].aws_s3_bucket_server_side_encryption_configuration.default will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + sse_algorithm = "AES256"%0A            }%0A        }%0A    }%0A%0A  # module.buckets["infrahouse8-aws-control"].aws_s3_bucket_versioning.enabled will be created%0A  + resource "aws_s3_bucket_versioning" "enabled" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLXMzLWNvbnRyb2wvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAic3Rkb3V0IjogIltjb21tYW5kXS9ob21lL3J1bm5lci93b3JrL190ZW1wL2JmMzdmNzY0LTY5N2ItNGY3NS1hOGRkLTkwOTFiY2ZjYjg1OS90ZXJyYWZvcm0tYmluIHBsYW4gLXZhci1maWxlPWNvbmZpZ3VyYXRpb24udGZ2YXJzIC0tb3V0PXRmLnBsYW5cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtczMtY29udHJvbFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtczMtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVx1MDAxYlswbVxuXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xdXHUwMDFiWzBtXG5cdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbFwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtczMtY29udHJvbFwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtczMtY29udHJvbF1cdTAwMWJbMG1cblx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVx1MDAxYlswbVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gIFx1MDAxYlszMm0rXHUwMDFiWzBtIGNyZWF0ZVx1MDAxYlswbVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuXHUwMDFiWzFtICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZTgtYXdzLWNvbnRyb2xcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXRcdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIge1xuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYWNjZWxlcmF0aW9uX3N0YXR1cyAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYWNsICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYXJuICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYnVja2V0ICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlOC1hd3MtY29udHJvbFwiXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBidWNrZXRfcmVnaW9uYWxfZG9tYWluX25hbWUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBmb3JjZV9kZXN0cm95ICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcG9saWN5ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVnaW9uICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVxdWVzdF9wYXllciAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZTgvYXdzLXMzLWNvbnRyb2xcIlxuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZTgvYXdzLWNvbnRyb2xcIlxuICAgICAgICB9XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlOC9hd3MtczMtY29udHJvbFwiXG4gICAgICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlOC9hd3MtY29udHJvbFwiXG4gICAgICAgIH1cbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHdlYnNpdGVfZG9tYWluICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2U4LWF3cy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFxuXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9ja1wiIFwicHVibGljX2FjY2Vzc1wiIHtcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGJsb2NrX3B1YmxpY19hY2xzICAgICAgID0gdHJ1ZVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYmxvY2tfcHVibGljX3BvbGljeSAgICAgPSB0cnVlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBidWNrZXQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWdub3JlX3B1YmxpY19hY2xzICAgICAgPSB0cnVlXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXN0cmljdF9wdWJsaWNfYnVja2V0cyA9IHRydWVcbiAgICB9XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2U4LWF3cy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHRcdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkXG5cdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb25cIiBcImRlZmF1bHRcIiB7XG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBidWNrZXQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJ1bGUge1xuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFwcGx5X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fYnlfZGVmYXVsdCB7XG4gICAgICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHNzZV9hbGdvcml0aG0gPSBcIkFFUzI1NlwiXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cblx1MDAxYlsxbSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2U4LWF3cy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZFxuXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImF3c19zM19idWNrZXRfdmVyc2lvbmluZ1wiIFwiZW5hYmxlZFwiIHtcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGJ1Y2tldCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gdmVyc2lvbmluZ19jb25maWd1cmF0aW9uIHtcbiAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBtZmFfZGVsZXRlID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHN0YXR1cyAgICAgPSBcIkVuYWJsZWRcIlxuICAgICAgICB9XG4gICAgfVxuXG5cdTAwMWJbMW1QbGFuOlx1MDAxYlswbSA0IHRvIGFkZCwgMCB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS5cblx1MDAxYlswbVx1MDAxYls5MG1cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MDAxYlswbVxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IFx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtczMtY29udHJvbFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtczMtY29udHJvbF1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLXMzLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYV1cdTAwMWJbMG0lMEFcdTAwMWJbMG1cdTAwMWJbMW1tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2xcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2xdXHUwMDFiWzBtJTBBXHUwMDFiWzBtXHUwMDFiWzFtbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1zMy1jb250cm9sXVx1MDAxYlswbSUwQVx1MDAxYlswbVx1MDAxYlsxbW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVx1MDAxYlswbSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICBcdTAwMWJbMzJtK1x1MDAxYlswbSBjcmVhdGVcdTAwMWJbMG0lMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEFcdTAwMWJbMW0gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlOC1hd3MtY29udHJvbFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldFx1MDAxYlswbSB3aWxsIGJlIGNyZWF0ZWQlMEFcdTAwMWJbMG0gIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIgeyUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFjY2VsZXJhdGlvbl9zdGF0dXMgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBhY2wgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYXJuICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGJ1Y2tldCAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZTgtYXdzLWNvbnRyb2xcIiUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGJ1Y2tldF9kb21haW5fbmFtZSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBidWNrZXRfcmVnaW9uYWxfZG9tYWluX25hbWUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gZm9yY2VfZGVzdHJveSAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBob3N0ZWRfem9uZV9pZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIG9iamVjdF9sb2NrX2VuYWJsZWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBwb2xpY3kgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVnaW9uICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZTgvYXdzLXMzLWNvbnRyb2xcIiUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2U4L2F3cy1jb250cm9sXCIlMEEgICAgICAgIH0lMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZTgvYXdzLXMzLWNvbnRyb2xcIiUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2U4L2F3cy1jb250cm9sXCIlMEEgICAgICAgIH0lMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gd2Vic2l0ZV9lbmRwb2ludCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBXHUwMDFiWzFtICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZTgtYXdzLWNvbnRyb2xcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3NcdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkJTBBXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9ja1wiIFwicHVibGljX2FjY2Vzc1wiIHslMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBibG9ja19wdWJsaWNfYWNscyAgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBibG9ja19wdWJsaWNfcG9saWN5ICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBidWNrZXQgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZ25vcmVfcHVibGljX2FjbHMgICAgICA9IHRydWUlMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXN0cmljdF9wdWJsaWNfYnVja2V0cyA9IHRydWUlMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2U4LWF3cy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHRcdTAwMWJbMG0gd2lsbCBiZSBjcmVhdGVkJTBBXHUwMDFiWzBtICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSByZXNvdXJjZSBcImF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uXCIgXCJkZWZhdWx0XCIgeyUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGJ1Y2tldCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBpZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcnVsZSB7JTBBICAgICAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGFwcGx5X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fYnlfZGVmYXVsdCB7JTBBICAgICAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzc2VfYWxnb3JpdGhtID0gXCJBRVMyNTZcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQVx1MDAxYlsxbSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2U4LWF3cy1jb250cm9sXCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkXHUwMDFiWzBtIHdpbGwgYmUgY3JlYXRlZCUwQVx1MDAxYlswbSAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0X3ZlcnNpb25pbmdcIiBcImVuYWJsZWRcIiB7JTBBICAgICAgXHUwMDFiWzMybStcdTAwMWJbMG1cdTAwMWJbMG0gYnVja2V0ID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIFx1MDAxYlszMm0rXHUwMDFiWzBtXHUwMDFiWzBtIGlkICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEElMEEgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSB2ZXJzaW9uaW5nX2NvbmZpZ3VyYXRpb24geyUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBtZmFfZGVsZXRlID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICBcdTAwMWJbMzJtK1x1MDAxYlswbVx1MDAxYlswbSBzdGF0dXMgICAgID0gXCJFbmFibGVkXCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQVx1MDAxYlsxbVBsYW46XHUwMDFiWzBtIDQgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LiUwQVx1MDAxYlswbVx1MDAxYls5MG0lMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTAwMWJbMG0lMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFcbjo6ZGVidWc6OnN0ZGVycjogXG46OmRlYnVnOjpleGl0Y29kZTogMFxuIiwgInN0ZGVyciI6ICIiLCAiYWRkIjogNCwgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19```
</p></details>